app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-06-09 21:53:28.908507"], ["updated_at", "2016-06-09 21:53:28.908507"]]
INSERT INTO "line_items" ("cart_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 980190963], ["product_id", 207281424], ["created_at", "2016-06-09 21:44:12.362455"], ["updated_at", "2016-06-09 21:44:12.362455"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2016-06-09 22:44:02.029320"], ["id", 9]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save