app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders"  ORDER BY created_at desc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    #@orders = Order.order('created_at desc').paginate(:page => 1)
    @orders = Order.paginate page: params[:page],
      #order: 'created_at desc',
      per_page: 10

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 7]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 7]]
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jon"], ["address", "No where"], ["email", "hdasd@djsda.com"], ["pay_type", "Purchase order"], ["created_at", "2016-06-16 22:15:03.093867"], ["updated_at", "2016-06-16 22:15:03.093867"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 7]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])