app/controllers/static_pages_controller.rb

  def index
    @static_pages = StaticPage.all
---
SELECT "static_pages".* FROM "static_pages"

  def create
    @static_page = StaticPage.new(static_page_params)

    respond_to do |format|
      if @static_page.save
---
INSERT INTO "static_pages" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @static_page.update(static_page_params)
---
UPDATE "static_pages" SET "content" = ?, "updated_at" = ? WHERE "static_pages"."id" = ?

    def set_static_page
      @static_page = StaticPage.find(params[:id])
---
SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."id" = ? LIMIT 1  [["id", 1]]